app/views/video_posts/_video_post.html.erb

SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('interracial'))
---
			<p>
				<%video_post.tag_list.each do |tag|%>