app/views/video_posts/show.html.erb

			<br>
			<% @video_post.video_comments.each do |comment| %>
---
SELECT "video_comments".* FROM "video_comments" WHERE "video_comments"."video_post_id" = ?  [["video_post_id", 1]]

				<p><%= simple_format comment.content%><br><small><%= comment.created_at%></small></p>
				<%if session[:user_id].present? && (current_user.is_admin || comment.user == current_user) %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]