app/controllers/authorize/approves_controller.rb

SELECT  "video_posts".* FROM "video_posts" WHERE "video_posts"."is_approved" = ? ORDER BY "video_posts"."created_at" ASC LIMIT ?  [["is_approved", false], ["LIMIT", 10]]
---
    def index
      @videos = VideoPost.all
                         .where(is_approved: false)
                         .order(created_at: :asc).first(10)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
SELECT  "video_posts".* FROM "video_posts" WHERE "video_posts"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
UPDATE "posts" SET "is_approved" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["is_approved", true], ["updated_at", 2017-03-18 15:51:01 UTC], ["id", 2]]
UPDATE "video_posts" SET "is_approved" = ?, "updated_at" = ? WHERE "video_posts"."id" = ?  [["is_approved", true], ["updated_at", 2017-03-22 21:59:59 UTC], ["id", 2]]
---
    def update
      @video_post = VideoPost.find(params[:id])
      @video_post.is_approved = true
      @video_post.save