app/controllers/authorize/post_videos_controller.rb

INSERT INTO "tags" ("name") VALUES (?)  [["name", "bioshock"]]
INSERT INTO "video_posts" ("user_id", "is_meh", "is_ok", "i_like_it", "created_at", "updated_at", "uploaded_video") VALUES (?, ?, ?, ?, ?, ?, ?)  [["user_id", 1], ["is_meh", 0], ["is_ok", 0], ["i_like_it", 0], ["created_at", 2017-03-22 19:46:09 UTC], ["updated_at", 2017-03-22 19:46:09 UTC], ["uploaded_video", "1490211845405.webm"]]
---
    def create
      @video = VideoPost.new(video_params)
      @video.user = current_user

      #conditionals
      resize_tags if @video.tag_list
      @video.is_approved = true if current_user.is_admin
      redirect_to @video if @video.save

SELECT  "video_posts".* FROM "video_posts" WHERE "video_posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def edit
      @video = VideoPost.find(params[:id])

SELECT  "video_posts".* FROM "video_posts" WHERE "video_posts"."id" = ? LIMIT ?  [["id", 8], ["LIMIT", 1]]
---
    def update
      @video = VideoPost.find(params[:id])

SELECT  "video_posts".* FROM "video_posts" WHERE "video_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "tags" WHERE "tags"."tag" = ?  [["tag", "bioshock"]]
DELETE FROM "video_posts" WHERE "video_posts"."id" = ?  [["id", 1]]
---
    def destroy
      video = VideoPost.find(params[:id])

      video.uploaded_video.remove!
      destroy_tags(video.tag_list)
      video.destroy