app/controllers/authorize/profiles_controller.rb

    def show
      @user = User.find(params[:id])
      @approved_posts = @user.video_posts.where(is_approved: true)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "video_posts".* FROM "video_posts" WHERE "video_posts"."user_id" = ? AND "video_posts"."is_approved" = ?  [["user_id", 1], ["is_approved", false]]

    def update
      @user = User.find(params[:id])
      @user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "password_digest" = ?, "profile_photo" = ? WHERE "users"."id" = ?  [["password_digest", "$2a$10$bcZF0f5NTbSukUjPxz.HueNHSoFAl7f1VpS05EwbCmrIEAdGuLdIW"], ["profile_photo", "1477121581086.jpg"], ["id", 1]]