app/controllers/pages_controller.rb

  def index
    redirect_to tag_path(random) if (ActsAsTaggableOn::Tag.all.length > 0 && params[:random])
    @most_used_tags = ActsAsTaggableOn::Tag.most_used(10)
    @videos = VideoPost.all
    search(params[:search][:tags]) if params[:search] && params[:search][:tags] != ''
    @videos = @videos.where(is_approved: true).order(created_at: :desc).first(20)
---
SELECT "tags".* FROM "tags" WHERE (LOWER(name) = LOWER('aaa'))
SELECT  "video_posts".* FROM "video_posts" WHERE (1 = 0) AND "video_posts"."is_approved" = ? ORDER BY "video_posts"."created_at" DESC LIMIT ?  [["is_approved", true], ["LIMIT", 20]]