app/controllers/registrations_controller.rb

  def create
    @user = User.new(registration_params)
    @user.is_admin = false

    #conditionals
    register(@user.id) if @user.save
---
INSERT INTO "users" ("username", "password_digest", "is_admin") VALUES (?, ?, ?)  [["username", "muholi"], ["password_digest", "$2a$10$zAaggQ8JuZ4Zs3QKYFjoeuNmfknpFMDmfDhZDRMhjSduxPAxFVh1a"], ["is_admin", false]]