app/controllers/tags_controller.rb

  def show
    @most_used_tags = ActsAsTaggableOn::Tag.most_used(10)
    @video_posts = VideoPost.tagged_with(params[:id])
                            .where(is_approved: true)
                            .first(20)
---
SELECT "video_posts".* FROM "video_posts" JOIN taggings video_posts_taggings_a194e46  ON video_posts_taggings_a194e46.taggable_id = video_posts.id AND video_posts_taggings_a194e46.taggable_type = 'VideoPost' AND video_posts_taggings_a194e46.tag_id = 4 WHERE "video_posts"."is_approved" = ?  [["is_approved", true]]