app/controllers/video_posts_controller.rb

  def show
    upvote if session[:id].present?
    @video_post = VideoPost.find(params[:id])
---
SELECT  "video_posts".* FROM "video_posts" WHERE "video_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @video_post = VideoPost.find(params[:id])
    increase_meh if params[:commit] == 'Meh'
    increase_ok if params[:commit] == "It's Ok"
    increase_like if params[:commit] == 'I like it'
    @video_post.save
---
SELECT  "video_posts".* FROM "video_posts" WHERE "video_posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "video_posts" SET "came_because" = ?, "updated_at" = ? WHERE "video_posts"."id" = ?  [["came_because", 1], ["updated_at", 2017-03-20 23:03:55 UTC], ["id", 1]]