app/controllers/video_comments_controller.rb

INSERT INTO "video_comments" ("content", "video_post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "<p>asfasf</p>"], ["video_post_id", 1], ["user_id", 1], ["created_at", 2017-03-23 17:31:52 UTC], ["updated_at", 2017-03-23 17:31:52 UTC]]
---
	def create
    comment = VideoComment.new(video_comment_params)
    comment.user = current_user
    video = comment.video_post
    redirect_to video if comment.save

SELECT  "video_comments".* FROM "video_comments" WHERE "video_comments"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "video_comments" WHERE "video_comments"."id" = ?  [["id", 1]]
---
	def destroy
		comment = VideoComment.find(params[:id])
    video = comment.video_post
    comment.destroy